benchmarks/concurrency_trial_1.txt


  █ TOTAL RESULTS 

    checks_total.......: 10000   14258.236627/s
    checks_succeeded...: 100.00% 10000 out of 10000
    checks_failed......: 0.00%   0 out of 10000

    ✓ status is 200 or 429

    CUSTOM
    admitted_requests..............: 100    142.582366/s
    rejected_requests..............: 9900   14115.654261/s

    HTTP
    http_req_duration..............: avg=13.29ms min=980µs   med=11.17ms max=116.83ms p(90)=19.18ms p(95)=26.97ms
      { expected_response:true }...: avg=63.44ms min=45.31ms med=59.89ms max=84.57ms  p(90)=79.07ms p(95)=79.52ms
    http_req_failed................: 99.00% 9900 out of 10000
    http_reqs......................: 10000  14258.236627/s

    EXECUTION
    iteration_duration.............: avg=13.82ms min=995µs   med=11.19ms max=130.97ms p(90)=19.24ms p(95)=27.53ms
    iterations.....................: 10000  14258.236627/s

    NETWORK
    data_received..................: 2.1 MB 3.0 MB/s
    data_sent......................: 780 kB 1.1 MB/s