benchmarks/concurrency_trial_2.txt


  █ TOTAL RESULTS 

    checks_total.......: 10000   12901.644315/s
    checks_succeeded...: 100.00% 10000 out of 10000
    checks_failed......: 0.00%   0 out of 10000

    ✓ status is 200 or 429

    CUSTOM
    admitted_requests..............: 100    129.016443/s
    rejected_requests..............: 9900   12772.627871/s

    HTTP
    http_req_duration..............: avg=14.8ms  min=3.67ms med=14.32ms max=95.83ms  p(90)=19.29ms p(95)=20.69ms
      { expected_response:true }...: avg=18.87ms min=7.6ms  med=18.96ms max=34.93ms  p(90)=31.47ms p(95)=32.48ms
    http_req_failed................: 99.00% 9900 out of 10000
    http_reqs......................: 10000  12901.644315/s

    EXECUTION
    iteration_duration.............: avg=15.32ms min=3.83ms med=14.35ms max=130.15ms p(90)=19.35ms p(95)=20.85ms
    iterations.....................: 10000  12901.644315/s

    NETWORK
    data_received..................: 2.1 MB 2.8 MB/s
    data_sent......................: 780 kB 1.0 MB/s