benchmarks/redis_failure.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-tests/k6/redis_failure.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 50s max duration (incl. graceful stop):
              * redis_failure: 200.00 iterations/s for 20s (maxVUs: 50-200, gracefulStop: 30s)


running (01.0s), 000/050 VUs, 198 complete and 0 interrupted iterations
redis_failure   [   5% ] 000/050 VUs  01.0s/20s  200.00 iters/s

running (02.0s), 000/050 VUs, 398 complete and 0 interrupted iterations
redis_failure   [  10% ] 000/050 VUs  02.0s/20s  200.00 iters/s

running (03.0s), 000/050 VUs, 598 complete and 0 interrupted iterations
redis_failure   [  15% ] 000/050 VUs  03.0s/20s  200.00 iters/s

running (04.0s), 000/050 VUs, 798 complete and 0 interrupted iterations
redis_failure   [  20% ] 000/050 VUs  04.0s/20s  200.00 iters/s

running (05.0s), 000/050 VUs, 998 complete and 0 interrupted iterations
redis_failure   [  25% ] 000/050 VUs  05.0s/20s  200.00 iters/s

running (06.0s), 115/115 VUs, 1018 complete and 0 interrupted iterations
redis_failure   [  30% ] 115/115 VUs  06.0s/20s  200.00 iters/s

running (07.0s), 160/161 VUs, 1127 complete and 0 interrupted iterations
redis_failure   [  35% ] 160/161 VUs  07.0s/20s  200.00 iters/s

running (08.0s), 182/183 VUs, 1282 complete and 0 interrupted iterations
redis_failure   [  40% ] 182/183 VUs  08.0s/20s  200.00 iters/s

running (09.0s), 192/194 VUs, 1461 complete and 0 interrupted iterations
redis_failure   [  45% ] 192/194 VUs  09.0s/20s  200.00 iters/s
time="2026-08-31T20:10:44+05:30" level=warning msg="Insufficient VUs, reached 200 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=redis_failure

running (10.0s), 200/200 VUs, 1530 complete and 0 interrupted iterations
redis_failure   [  50% ] 200/200 VUs  10.0s/20s  200.00 iters/s

running (11.0s), 094/200 VUs, 1743 complete and 0 interrupted iterations
redis_failure   [  55% ] 094/200 VUs  11.0s/20s  200.00 iters/s

running (12.0s), 000/200 VUs, 2037 complete and 0 interrupted iterations
redis_failure   [  60% ] 000/200 VUs  12.0s/20s  200.00 iters/s

running (13.0s), 000/200 VUs, 2237 complete and 0 interrupted iterations
redis_failure   [  65% ] 000/200 VUs  13.0s/20s  200.00 iters/s

running (14.0s), 000/200 VUs, 2437 complete and 0 interrupted iterations
redis_failure   [  70% ] 000/200 VUs  14.0s/20s  200.00 iters/s

running (15.0s), 000/200 VUs, 2637 complete and 0 interrupted iterations
redis_failure   [  75% ] 000/200 VUs  15.0s/20s  200.00 iters/s

running (16.0s), 000/200 VUs, 2837 complete and 0 interrupted iterations
redis_failure   [  80% ] 000/200 VUs  16.0s/20s  200.00 iters/s

running (17.0s), 000/200 VUs, 3037 complete and 0 interrupted iterations
redis_failure   [  85% ] 000/200 VUs  17.0s/20s  200.00 iters/s

running (18.0s), 000/200 VUs, 3237 complete and 0 interrupted iterations
redis_failure   [  90% ] 000/200 VUs  18.0s/20s  200.00 iters/s

running (19.0s), 000/200 VUs, 3437 complete and 0 interrupted iterations
redis_failure   [  95% ] 000/200 VUs  19.0s/20s  200.00 iters/s

running (20.0s), 000/200 VUs, 3637 complete and 0 interrupted iterations
redis_failure   [ 100% ] 000/200 VUs  20.0s/20s  200.00 iters/s


  █ TOTAL RESULTS 

    checks_total.......: 3640    181.975952/s
    checks_succeeded...: 100.00% 3640 out of 3640
    checks_failed......: 0.00%   0 out of 3640

    ✓ status is 200, 429, or 500

    CUSTOM
    status_200.....................: 1963   98.137031/s
    status_429.....................: 1165   58.242303/s
    status_500.....................: 512    25.596617/s

    HTTP
    http_req_duration..............: avg=261.71ms min=377µs    med=2.3ms  max=2.12s p(90)=1.02s p(95)=2.1s
      { expected_response:true }...: avg=215.35ms min=435µs    med=2.51ms max=2.12s p(90)=1.89s p(95)=2.1s
    http_req_failed................: 46.07% 1677 out of 3640
    http_reqs......................: 3640   181.975952/s

    EXECUTION
    dropped_iterations.............: 361    18.047615/s
    iteration_duration.............: avg=261.9ms  min=429.41µs med=2.45ms max=2.12s p(90)=1.02s p(95)=2.1s
    iterations.....................: 3640   181.975952/s
    vus............................: 0      min=0            max=200
    vus_max........................: 200    min=50           max=200

    NETWORK
    data_received..................: 765 kB 38 kB/s
    data_sent......................: 284 kB 14 kB/s



running (20.0s), 000/200 VUs, 3640 complete and 0 interrupted iterations
redis_failure ✓ [ 100% ] 000/200 VUs  20s  200.00 iters/s